//
//  createProlectGuide.swift
//  RoadMapSwift
//
//  Created by Валерия Пономарева on 04.12.2025.
//

import Foundation

/*
 📝 Создай пустую папку, открой Xcode → новый проект → поставь ✅ создание git репо в Xcode → push через GitHub Desktop — гарантия: чистый, профи проект БЕЗ лишних вложенных папок
*/

/* Основные для заметок/шпаргалок
 1. ✅ — галочка, успех, проверено/готово
 2. ❌ — крестик, ошибка
 3. ⚠️ — предупреждение
 4. ℹ️ — информация
 5. 💡 — идея, совет
 6. 📝 — заметка
 7. 📖 — открытая книга, руководство
 8. ✏️ — карандаш, редактирование
 9. 🧑‍💻 — разработчик, программист
 10. 🔧 — настройка, инструмент
 11. 🚀 — запуск, быстрое действие
 12. 🔥 — важное, что требует внимания
 13. ❓ — вопрос/непонятно
 14. ❗ — срочно/важно
 15. ⏳ — ожидание/процесс
 16. 🗑️ — удалить
 17. 🔄 — обновление/цикл
 18. 🆕✨ — новое
 19. 💻 — компьютер
 20. 🔍 — поиск/debug
 21. 📱 — iOS/macOS
*/
  

