//
//  main.swift
//  RoadMapSwift
//
//  Created by Валерия Пономарева on 04.12.2025.
//

import Foundation

print("Задача 1. 'Описание ноутбука': объяви 5 let / var разных типов, характеризующих мой ноутбук. Для каждого свойства укажи тип данных, используя type annotation. Подумайте, какие характеристики д.б. let, а какие - var.")

func displayName() {
    let name = "Vale.ponick-pro! 🚀"
    print(name)
}

print(displayName())

/* Задача 1. 'Описание ноутбука': объяви 5 let / var разных типов, характеризующих мой ноутбук. Для каждого свойства укажи тип данных, используя type annotation. Подумайте, какие характеристики д.б. let, а какие - var." */


